src/cf/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьДоФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменён</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ОбщийМодульПолнотекстовыйПоиск/Ext/Module.bsl
Процедура ПолнотекстовыйПоиск() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.ИмяФайла КАК ИмяФайла,
		|	Файлы.Содержание КАК Содержание,
		|	Файлы.ПутьДоФайла КАК ПутьДоФайла,
		|	Файлы.Код КАК Код,
		|	Файлы.Изменён КАК Изменён
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Изменён = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Прав(ВыборкаДетальныеЗаписи.ИмяФайла,3) = "txt" Тогда
			Путь =  ВыборкаДетальныеЗаписи.ПутьДоФайла;
			ФайлТекс = Новый ЧтениеТекста(Путь, КодировкаТекста.UTF8);
			ФайлСсылка = Справочники.Файлы.НайтиПоКоду(ВыборкаДетальныеЗаписи.Код);
			ФайлОбъект = ФайлСсылка.ПолучитьОбъект();
			ФайлОбъект.Содержание = ФайлТекс.Прочитать();
			ФайлОбъект.Изменён = Ложь;
			ФайлОбъект.Записать();
			ФайлТекс.Закрыть();		
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
